In [78]:
import pandas as pd

#Load data from sample.csv to table
data = pd.read_csvdata = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', sep='\s*,\s*',header=None, encoding='ascii', engine='python')

#Rename the columns
data.columns = ['age', 'workclass', 'fnlwgt', 'education', 'education_num', 'marital_status', 'occupation', 'relationship', 'race', 'sex', 'capital_gain', 'capital_loss', 'hours_per_week', 'native_country', 'label']

data.head(5)

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,label
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [81]:
import sqlalchemy
from sqlalchemy import create_engine
# Create Engine
engine = create_engine('sqlite:///mydb1', echo =False)
data.to_sql('mydb1',engine,if_exists='replace',chunksize=10)

In [82]:
import sqlite3 
connection = sqlite3.connect("mydb1")
cursor = connection.cursor() 
cursor.execute('select count(*) from mydb1')
print(cursor.fetchall())

[(32561,)]

In [84]:
#2. Write two basic update queries
cursor.execute('update mydb1 set age=55 where fnlwgt = 83311')
print(cursor.fetchall())

[]

In [85]:
#Check age
cursor.execute('select * from  mydb1 where fnlwgt = 83311')
print(cursor.fetchall())

[(1, 55, 'Self-emp-not-inc', 83311, 'Bachelors', 13, 'Married-civ-spouse', 'Exec-managerial', 'Husband', 'White', 'Male', 0, 0, 13, 'United-States', '<=50K'), (16474, 55, 'Self-emp-not-inc', 83311, 'Prof-school', 15, 'Married-civ-spouse', 'Prof-specialty', 'Husband', 'White', 'Male', 0, 0, 30, 'United-States', '>50K')]

In [86]:
# Trial 2
cursor.execute('select count(*) from  mydb1  where education_num = 13')
print(cursor.fetchall())

[(5355,)]

In [87]:
# Update-2
cursor.execute('update mydb1 set education_num = 113  where education_num = 13')
print(cursor.fetchall())

[]

In [88]:
#Check
cursor.execute('select * from  mydb1  where education_num = 113 limit 10')
test= pd.DataFrame(cursor.fetchall())   
test

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,0,39,State-gov,77516,Bachelors,113,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,1,55,Self-emp-not-inc,83311,Bachelors,113,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,4,28,Private,338409,Bachelors,113,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
3,9,42,Private,159449,Bachelors,113,Married-civ-spouse,Exec-managerial,Husband,White,Male,5178,0,40,United-States,>50K
4,11,30,State-gov,141297,Bachelors,113,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,0,0,40,India,>50K
5,12,23,Private,122272,Bachelors,113,Never-married,Adm-clerical,Own-child,White,Female,0,0,30,United-States,<=50K
6,25,56,Local-gov,216851,Bachelors,113,Married-civ-spouse,Tech-support,Husband,White,Male,0,0,40,United-States,>50K
7,32,45,Private,386940,Bachelors,113,Divorced,Exec-managerial,Own-child,White,Male,0,1408,40,United-States,<=50K
8,41,53,Self-emp-not-inc,88506,Bachelors,113,Married-civ-spouse,Prof-specialty,Husband,White,Male,0,0,40,United-States,<=50K
9,42,24,Private,172987,Bachelors,113,Married-civ-spouse,Tech-support,Husband,White,Male,0,0,50,United-States,<=50K

In [89]:
#3. Write two delete queries

cursor.execute('select count(*) from  mydb1  where fnlwgt=338409')
print(cursor.fetchall())

[(1,)]

In [90]:
cursor.execute('delete from mydb1 where fnlwgt=338409')
print(cursor.fetchall())

[]

In [91]:
#Count the number of records deleted
cursor.execute('select count(*) from  mydb1  where fnlwgt=338409')
print(cursor.fetchall())

[(0,)]

In [92]:
# Delete#2
cursor.execute('select count(*) from  mydb1  where fnlwgt=234721')
print(cursor.fetchall())

[(1,)]

In [93]:
#Delete
cursor.execute('delete from mydb1 where fnlwgt=234721')
print(cursor.fetchall())

[]

In [94]:
#Count the number of records deleted
cursor.execute('select count(*) from  mydb1  where fnlwgt=234721')
print(cursor.fetchall())

[(0,)]

In [95]:
#4. Write two filter queries
cursor.execute('select count(sex) from mydb1 where sex="Male"')
print(cursor.fetchall())

[(21789,)]

In [ ]:
#Filter#2

In [96]:
cursor.execute('select count(sex) from mydb1 where sex="Female"')
print(cursor.fetchall())

[(10770,)]

In [97]:
#Write two function queries
#Function query 1
def fib(n):
    a, b = 0, 1
    for _ in range(n):
        yield a
        a, b = b, a + b

In [98]:
cursor.execute('CREATE TABLE IF NOT EXISTS fib (calculated_value INTEGER)')
cursor.executemany('INSERT INTO fib VALUES (?)',[(str(x),) for x in fib(10)])
#run a sample query
cursor.execute('SELECT * FROM fib')
print(cursor.fetchall())

[(0,), (1,), (1,), (2,), (3,), (5,), (8,), (13,), (21,), (34,)]

In [101]:
print(np.arange(5))

[0 1 2 3 4]

In [108]:
#Function query 1
def getRange(n):
    return np.arange(n)

cursor.execute('CREATE TABLE IF NOT EXISTS Range (Number_Range INTEGER)')
cursor.executemany('INSERT INTO Range VALUES (?)',[(str(x),) for x in getRange(6)])
#run a sample query
cursor.execute('SELECT * FROM Range')
print(cursor.fetchall())

[(0,), (1,), (2,), (3,), (4,), (5,), (0,), (1,), (2,), (3,), (4,), (5,)]

In [106]:
cursor.execute('drop table Range')